 IDENTIFICATION DIVISION.
 PROGRAM-ID. DUMMY.

 DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 WS-A PIC 9 VALUE 2.

    LINKAGE SECTION.
    01 LK-DATA.
        05 LK-LENGTH     PIC S9(04) COMP.
        05 LK-VARIABLE  PIC X(08).

 PROCEDURE DIVISION USING LS-STUDENT-ID, LS-STUDENT-NAME.
    DISPLAY 'In Called Program'.
    MOVE 1111 TO LS-STUDENT-ID.
    PERFORM SAMPLE.

    SAMPLE SECTION.
    A-PARA.
        DISPLAY 'IN A-PARA'
        GO TO B-PARA.

    B-PARA.
    DISPLAY 'IN B-PARA '.
    GO TO C-PARA D-PARA DEPENDING ON WS-A.

    C-PARA.
    DISPLAY 'IN C-PARA '.

    D-PARA.
    DISPLAY 'IN D-PARA '.
 EXIT PROGRAM.