 IDENTIFICATION DIVISION.
 PROGRAM-ID.  SampleTable.

 DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 SUBS PIC 9(5) COMP.
        01 INVENTORY-RECORD.
            05 Field-A PIC X OCCURS 10000 TIMES.
        01 SAMPLE1-RECORD
            05 Field-A PIC X OCCURS 1 TIMES.
        01 ITEM1 PIC X(5).
        01 ITEM2 PIC X(5).
        01 ITEM3 REDEFINES ITEM1 PIC X(5).

 PROCEDURE DIVISION.
    PERFORM VARYING SUBS FROM 1 BY 1 UNTIL SUBS > 10000
        MOVE ITEM1 TO Field-A (SUBS)
    END-PERFORM.
    MOVE 'ABC' TO ITEM1.
    MOVE 'ABC' TO ITEM2.

    A-PARA.
    PERFORM DISPLAY 'IN A-PARA'
    END-PERFORM.
    PERFORM C-PARA THRU E-PARA.

    B-PARA.
    DISPLAY 'IN B-PARA'.
    STOP RUN.

    C-PARA.
    DISPLAY 'IN C-PARA'.

    D-PARA.
    DISPLAY 'IN D-PARA'.

    E-PARA.
    DISPLAY 'IN E-PARA'.

 STOP RUN.


