 IDENTIFICATION DIVISION.
 PROGRAM-ID.  SampleTable.

 DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 SUBS PIC 9(5) COMP.
        01 INVENTORY-RECORD.
            05 Field-A PIC X OCCURS 10000 TIMES.
        01 ITEM1 PIC X.

 PROCEDURE DIVISION.
    PERFORM VARYING SUBS FROM 1 BY 1 UNTIL SUBS > 10000
        MOVE ITEM1 TO Field-A (SUBS)
    END-PERFORM.
 STOP RUN.



